## 连线

云平台的trunk口链接交换机的trunk口，云平台的access口链接交换机的access口，上管理下业务（上trunk下access）

配置线一段连接交换机的Console（配置口）

## 主机配置

主机的IP设置为：192.168.100.0/24 192.168.100.100

##### 单网口要实现内外网连接

主机ip设置：192.168.100.0/24

电脑连接Internet后添加永久路由，打开终端管理员，

```powershell
route print 					//打印route表，查看是否有永久路由
route delete  网络目的地址 [mask 子网掩码] 网关					//删除多余的永久路由
route -p add 192.168.100.0 mask 255.255.255.0 192.168.100.1
#然后再添加赛题上所需要的网络，网关是192.168.100.1	这里以10.1.30.0/24与10.1.40.0/24网段为例
route -p add 10.1.30.0 mask 255.255.255.0 192.168.100.1
route -p add 10.1.40.0 mask 255.255.255.0 192.168.100.1
```



## 交换机配置

##### 连接三层交换

三层交换使用的协议是：Serial

端口一般它会自动检测，默认是：COM3

波特率一般是：9600、115200，这里是使用的9600

##### 登录到三层交换

```
Username: admin
Password:					//非明文输入
DCWS-6028#config terminal	//进入到交换机的配置模式
```

创建所需要的vlan（100，30，40）并将其配上网关

```
CS6200-28X-EI(config)#int vlan 100
CS6200-28X-EI(config-if-vlan100)#ip add 192.168.100.0 255.255.255.0
CS6200-28X-EI(config-if-vlan100)#int vlan 30
CS6200-28X-EI(config-if-vlan30)#ip add 10.1.30.254 255.255.255.0
CS6200-28X-EI(config-if-vlan30)#int vlan 40
CS6200-28X-EI(config-if-vlan40)#ip add 10.1.40.254 255.255.255.0
```

配置Ethernet1/0/1为trunk端口允许vlan100，30，40通过

```
CS6200-28X-EI(config-if-vlan40)#int e 1/0/1
CS6200-28X-EI(config-if-ethernet1/0/1)#switchport trunk allowed vlan 100,30,40
```

配置Ethernet1/0/2-8，允许vlan30，40通过

```
CS6200-28X-EI(config-if-port-range)#int e 1/0/2-8  
CS6200-28X-EI(config-if-port-range)#switchport access vlan 100
```

###### 保存交换及配置

```
CS6200-28X-EI#writ
```

###### 重启交换机

```
CS6200-28X-EI#reload
```

###### 恢复出厂

```
CS6200-28X-EI#set default
CS6200-28X-EI#writ
CS6200-28X-EI#reload
```



## 云平台配置

##### 登录云平台：

在浏览器中输入：http://192.168.100.1/dcncloud/

管理员用户：admin

​			密码：dcncloud

##### 云平台创建网络步骤

点击管理员==>网络==>添加网络，接下来如图：

![创建网络01](C:\Users\SUI\Desktop\朱子恒\PNG\创建网络01.png)



![创建网络02](C:\Users\SUI\Desktop\朱子恒\PNG\创建网络02.png)

![创建网络03](C:\Users\SUI\Desktop\朱子恒\PNG\创建网络03.png)

同样vlan40也是如此。

###### 创建网络端口

在网络界面，点击网络名称下的==>Vlan30==>点击端口==>点击添加端口

修改：名称，将指定ip地址或子网（改为固定的IP地址），固定的IP地址（输入题上所需要的IP地址）如图：

![创建端口](C:\Users\SUI\Desktop\朱子恒\PNG\创建端口.png)

##### 创建实例步骤

在平台主页面点击==>普通用户==>实例==>创建实例

需要填写：详情，源，实例类型，网络接口，这些提上都有说明接下来以10.1.30.101为例如图：

![创建实例01](C:\Users\SUI\Desktop\朱子恒\PNG\创建实例01.png)

![创建实例02](C:\Users\SUI\Desktop\朱子恒\PNG\创建实例02.png)

![创建实例03](C:\Users\SUI\Desktop\朱子恒\PNG\创建实例03.png)

![创建实例04](C:\Users\SUI\Desktop\朱子恒\PNG\创建实例04.png)



## 实例配置

##### 重置SID

这些批量生产的的实例使用的镜像都是相同的，且他们的SID也是相同的要想在他们上面做服务，第一步就是重置SID使用的运行命令：sysprep  在运行后弹出的文件夹想双击运行程序，然后勾选通用，点击确定

###### 操作演示

云平台点击实例==>点击创建好的实例名称==>点击控制台==>点击右上角的Send CtrAltDel==>输入密码后进入系统（一般是Pass-1234）,接下来如图：

![重置SID01](C:\Users\SUI\Desktop\朱子恒\PNG\重置SID01.png)



![重置SID02](C:\Users\SUI\Desktop\朱子恒\PNG\重置SID02.png)



然后就像是安装操作系统一样：点击下一步==>以后再说==>我接受==>设置密码,如图：



![重置SID03](C:\Users\SUI\Desktop\朱子恒\PNG\重置SID03.png)

![重置SID04](C:\Users\SUI\Desktop\朱子恒\PNG\重置SID04.png)

![重置SID05](C:\Users\SUI\Desktop\朱子恒\PNG\重置SID05.png)

![重置SID06](C:\Users\SUI\Desktop\朱子恒\PNG\重置SID06.png)



##### 添加防火墙规则

```powershell
netsh advfirewall firewall add rule name=1 dir=in action=allow
netsh advfirewall firewall add rule name=1 dir=out action=allow
```

##### 设置静态IP地址,

dns,计算机名称，然后重启

```powershell
netsh interface ip set add "以太网" ststic 10.1.30.101 255.255.255.0 10.1.30.254
netsh interface ipv4 set dns "以太网" static 10.1.30.101 primary
Rename-Computer Windows1 -Restart
```

